emacs/modes/helm-projectile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-13 二 10:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>helm-projectile</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">helm-projectile</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa2fd6a">1. 概述</a></li>
<li><a href="#org1c9da76">2. 安装</a>
<ul>
<li><a href="#orgddf8b6b">2.1. package.el</a></li>
<li><a href="#orgae3ea77">2.2. el-get</a></li>
<li><a href="#org5265ba0">2.3. Emacs Prelude</a></li>
<li><a href="#org18b6b91">2.4. Debian and Ubuntu</a></li>
</ul>
</li>
<li><a href="#org1c63cf1">3. 配置</a></li>
<li><a href="#org48f60b5">4. 使用</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaa2fd6a" class="outline-2">
<h2 id="orgaa2fd6a"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
Projectile 可以与 Helm 集成，通过 helm-source-projectile-projects，helm-source-projectile-files-list，helm-source-projectile-buffers-list 和 helm-source-projectile-recentf-list（位于 helm-projectile.el）。 还有一个使用 Projectile 文件源调用 Helm 的示例函数。 可以这样调用它：
</p>
<pre class="example">
M-x helm-projectile
</pre>

<p>
更好的是调用键绑定 =C-c p h=。
</p>
</div>
</div>

<div id="outline-container-org1c9da76" class="outline-2">
<h2 id="org1c9da76"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
安装 helm-projectile 的推荐方法是通过 package.el。
</p>
</div>

<div id="outline-container-orgddf8b6b" class="outline-3">
<h3 id="orgddf8b6b"><span class="section-number-3">2.1</span> package.el</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>MELPA
You can install a snapshot version of helm-projectile from the MELPA repository. The version of Projectile there will always be up-to-date, but it might be unstable (albeit rarely).</li>
<li>MELPA Stable
You can install the last stable version of helm-projectile from the MELPA Stable repository.</li>
</ul>
</div>
</div>

<div id="outline-container-orgae3ea77" class="outline-3">
<h3 id="orgae3ea77"><span class="section-number-3">2.2</span> el-get</h3>
<div class="outline-text-3" id="text-2-2">
<p>
helm-projectile is also available for installation from the el-get package manager.
</p>
</div>
</div>

<div id="outline-container-org5265ba0" class="outline-3">
<h3 id="org5265ba0"><span class="section-number-3">2.3</span> Emacs Prelude</h3>
<div class="outline-text-3" id="text-2-3">
<p>
helm-projectile is naturally part of the Emacs Prelude. If you're a Prelude user - helm-projectile is already properly configured and ready for action.
</p>
</div>
</div>

<div id="outline-container-org18b6b91" class="outline-3">
<h3 id="org18b6b91"><span class="section-number-3">2.4</span> Debian and Ubuntu</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Users of Debian 9 or later or Ubuntu 16.04 or later may apt-get install elpa-helm-projectile.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c63cf1" class="outline-2">
<h2 id="org1c63cf1"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">helm-projectile</span>)
(helm-projectile-on)
</pre>
</div>
</div>
</div>
<div id="outline-container-org48f60b5" class="outline-2">
<h2 id="org48f60b5"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
对于那些喜欢 helm 胜过 ido 的人来说，helm-projectile-switch-project 可以用来代替 projectile-switch-project 切换项目。请注意，这与简单地将 projectile-completion-system 设置为 helm 不同，后者只是使 projectile 能够使用 Helm 完成来补全项目名称。使用 helm-projectile-switch-project 的好处是，在任何选定的项目中，可以触发许多动作，而不仅仅是 “切换到项目” 动作。目前，有五个操作：“切换到项目”，“在 Dired 打开项目目录”，“在 vc-dir 或 magit 中打开项目根目录”，“切换到 Eshell” 和 “Grep 项目文件”。将来会添加更多的行动。
</p>

<p>
helm-projectile 能够打开多个文件。先使用 <code>C-SPC</code> 或 <code>M-a</code> 标记文件，然后按 RET，将打开所有选定的文件。
</p>

<p>
请注意，helm grep 与 projectile-grep 不同，因为 helm grep 是增量的。要使用它，请选择您的项目（按 C-SPC 选择多个项目），按 “C-s”（或 “C-u C-s” 表示递归 grep），然后键入正则表达式。在 mini buffer 中键入正则表达式时，将以递增方式显示实时 grep 结果。
</p>

<p>
helm-projectile 还提供常见 Projectile 命令的 Helm 版本。目前，这些是受支持的命令：
</p>
<ul class="org-ul">
<li>helm-projectile-switch-project</li>
<li>helm-projectile-find-file</li>
<li>helm-projectile-find-file-in-known-projects</li>
<li>helm-projectile-find-file-dwim</li>
<li>helm-projectile-find-dir</li>
<li>helm-projectile-recentf</li>
<li>helm-projectile-switch-to-buffer</li>
<li>helm-projectile-grep (can be used for both grep or ack)</li>
<li>helm-projectile-ag</li>
<li>helm-projectile-rg</li>
<li>Replace Helm equivalent commands in projectile-commander</li>
<li>A virtual directory manager that is unique to Helm Projectile</li>
</ul>


<p>
与普通的 Projectile 命令相比，即使普通命令使用 helm 作为补全系统，为什么要使用这些命令？答案是，Helm 特定命令提供了更多有用的功能。例如，helm-projectile-switch-project 允许在 Dired，Magit 或 Eshell 中打开项目。helm-projectile-find-file 重用 helm-find-files 中的动作（有很多）并且能够打开多个文件。另一个原因是，在大型源树中，projectile 可能很慢，因为它必须打开所有可用的源。
</p>

<p>
如果要使用这些命令，则必须将其激活以替换常规的 Projectile 命令：
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(setq helm-projectile-fuzzy-match nil)</span>
(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">helm-projectile</span>)
(helm-projectile-on)
</pre>
</div>

<p>
如果你已经激活了 helm-projectile 键绑定，但不喜欢它，可以使用命令 helm-projectile-off 关闭它，而使用普通的 Projectile 绑定。同样，如果要在 Helm Projectile 中禁用模糊匹配（默认情况下启用），则必须在加载 helm-projectile 之前将 helm-projectile-fuzzy-match 设置为 nil。
</p>

<p>
要完全学习 Helm Projectile 并了解它的功能，应该参考本指南：<a href="http://tuhdo.github.io/helm-projectile.html">使用 Projectile 和 Helm Projectile 探索大型项目</a> 。
</p>

<p>
显然你需要安装 Helm 才能工作。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-13 二 10:42</p>
<p class="validation"></p>
</div>
</body>
</html>
